print("Перша константа", False)
print("Друга константа", True)
print("Третя константа", None)

# 2.2 Результат роботи вбудованих функцій за допомогою команд:

print("3 в 3 степені дорівнює: ", pow(3,3))
print("Число 4 в вісімковій системі числення дорівнює: ", oct(4))
print("Мінімальне число з чисел 1,29,4,5: ",min(1,29,4,5))
print("")

# 2.3 Результат роботи циклу і розгалужень за допомогою команд:
x= [5 for i in range(25)]
print("Виведення 25 п'ятірок з масиву: ",x)

a = 15
print("Змінна 'a' дорівнює 15" if a == 15 else "Змінна 'a' не дорівнює 15")
print("")

# 2.4 Результат роботи конструкції `try`->`except`->`finally` за допомогою команд:
y=[545]
print("Що буде якщо вивести [555] елемент масиву y[]?: ")
try:
    print(y[555])
except Exception as e:
    print(e)
finally:
    print("То ось що буде!")
print("")

# 2.5 Результат роботи контекст-менеджера `with` за допомогою команд:
i=1
with open("lab2a_1.py", "r") as f:
	for line in f:
		print("Line " + str(i) + ": " + line)
		i=i+1
print("")

# 2.6 Результат роботи з `lambdas` за допомогою команд:
_lambda = lambda f_number, s_number: f'Сума першого і другого числа дорівнює {f_number + s_number}'
print("Розташування функції в памяті: ", _lambda)
print("Виклик лямбди: ", _lambda(10, 15))